about_text = [
    '✅ Бот поможет быстрее сработаться риелторам. Как? Все просто: если все объекты'
    + ' риелторов хранятся в одном месте, то легко в нужный момент найти их и связаться для показа.'
    + ' Поиск объектов по сайтам, группам и чатам – в прошлом! ',
    '',
    '*Как это работает*? У бота есть '
    + 'простое меню. Через команды вы можете добавить свои объекты или '
    + 'посмотреть объекты других риелторов и связаться друг с другом. Всё просто!',
    '',
    '✅ *ВАЖНО*! Разработчик не ставил перед собой цель "объехать" вас - риелторов, '
    + 'или быть между вами посредником: звонить по объекту будут вам.'
    + ' Смелей добавляйте объекты! 👍',
    '',
    'Обращения по работе бота направляйте @davletelvir. ',
    '',
    '*Версия 1.1:*\n'
    + '- Возможность добавить в базу квартиры, комнаты, дома, таунхаусы и участки;\n'
    + '- Просмотр всех объектов;\n'
    + '- Просмотр своих объектов;\n'
    + '- Удаление объектов;\n'
    + '- Редактирование цены.',
]
